app/Controllers/Frontend/HomeController.php

SELECT *
FROM `product_category`
SELECT *
FROM `product`
---
    public function index()
    {
        // config
        $product_category = new ProductCategoryModel();
        $data['product_categories'] = $product_category->get()->getResult();
        // config menu
        $product = new ProductModel();
        $data['products'] = $product->get()->getResult();