app/Controllers/Frontend/HomeController.php

    public function index()
    {
        // config
        $product_category = new ProductCategoryModel();
        $data['product_categories'] = $product_category->get()->getResult();
        // config menu
        $product = new ProductModel();
        $data['products'] = $product->where('status', 1)->get()->getResult();
---
SELECT *
FROM `product`
WHERE `status` = 1