app/Controllers/Extranet/ProductController.php

    public function index()
    {
        // product
        $app = new ProductModel();
        $data['products'] = $app->orderBy('code', 'DESC')->get()->getResult();
---
SELECT *
FROM `product`
ORDER BY `code` DESC

    public function create()
    {
        // product category
        $product_category = new ProductCategoryModel();
        $data['product_categories'] = $product_category->get()->getResult();
---
SELECT *
FROM `product_category`